<script lang="ts" setup>
import { useHead } from '@unhead/vue'

import { constructPageTitle } from '@/utils'

useHead({
  title: constructPageTitle('FAQ')
})
</script>

<template>
  <div class="container font-hnd">
    <div class="mx-auto mt-20 max-w-[800px] md:mt-40">
      <h1
        class="relative text-[34px] font-bold uppercase leading-none sm:text-[38px] lg:text-[40px] xl:text-[44px]"
      >
        Информация о доставке
      </h1>

      <div class="pt-30 md:pt-40">
        <div class="mb-35">
          <h3 class="mb-10 text-[22px] font-bold lg:text-[26px] xl:text-[28px]">
            Описание:
          </h3>
          <p>
            Наши услуги доставки предоставляют вам удобство и надежность. Мы
            стремимся сделать процесс заказа и доставки максимально простым и
            прозрачным для наших клиентов. Ниже вы найдете подробную информацию
            о наших услугах доставки.
          </p>
        </div>

        <div class="mb-20">
          <h3 class="mb-4 text-[18px] font-bold text-[]">
            1. Способы доставки:
          </h3>
          <p class="mb-10">
            Мы предлагаем несколько способов доставки, чтобы удовлетворить
            разные потребности клиентов:
          </p>
          <ul>
            <li>
              <strong>- Стандартная доставка:</strong>
              Обычно занимает до 1 недели и доступна по всей стране. Стоимость
              зависит от веса и размера заказа.
            </li>
            <li>
              <strong>- Самовывоз:</strong>
              На данный момент не доступен.
            </li>
          </ul>
        </div>

        <div class="mb-20">
          <h3 class="mb-4 text-[18px] font-bold text-[]">
            2. Стоимость доставки:
          </h3>
          <p>
            Стоимость доставки рассчитывается исходя из веса и размера заказа, а
            также выбранного способа доставки. При оформлении заказа вы сможете
            увидеть точную стоимость доставки.
          </p>
        </div>

        <div class="mb-20">
          <h3 class="mb-4 text-[18px] font-bold text-[]">
            3. Отслеживание заказа:
          </h3>
          <p>
            После оформления заказа он появится в личном кабинете во вкладке
            «Orders», там же вы можете узнать трек-номер заказа.
          </p>
        </div>

        <div class="mb-20">
          <h3 class="mb-4 text-[18px] font-bold text-[]">
            4. География доставки:
          </h3>
          <p>
            Мы осуществляем доставку по всему миру, кроме Украины (но работаем
            над тем, чтобы добавить ее как можно скорее). Пожалуйста, обратитесь
            к нашей службе поддержки, если вам нужна доставка в отдаленные или
            недоступные места.
          </p>
        </div>

        <div class="mb-20">
          <h3 class="mb-4 text-[18px] font-bold text-[]">
            5. Возврат и обмен:
          </h3>
          <p>
            Если у вас возникли проблемы с заказом, пожалуйста, свяжитесь с
            нашей службой поддержки. Если вы получили некачественный товар, мы
            готовы вернуть вам средства.
          </p>
        </div>

        <div class="mb-20">
          <h3 class="mb-4 text-[18px] font-bold text-[]">
            6. Свяжитесь с нами:
          </h3>
          <p>
            Если у вас есть дополнительные вопросы или вам нужна дополнительная
            информация о доставке, не стесняйтесь связаться с нашей службой
            поддержки. Мы всегда готовы помочь.
          </p>
        </div>
      </div>
    </div>
  </div>
</template>

<style lang="scss" scoped>
.title {
  @include laptop-big {
    -webkit-text-stroke-width: 1px;
  }
}
</style>
