<script lang="ts" setup>
import { useHead } from '@unhead/vue'
import { onMounted, onUnmounted } from 'vue'

import AppBackNav from '@/components/features/AppBackNav.vue'
import { constructPageTitle } from '@/utils'

useHead({
  title: constructPageTitle('Privacy')
})

onMounted(() => {
  document.querySelector('#app')?.classList.remove('app-background-effects')
})
onUnmounted(() => {
  document.querySelector('#app')?.classList.add('app-background-effects')
})
</script>

<template>
  <div class="container font-hnd">
    <div class="mx-auto mt-20 max-w-[800px] md:mt-40">
      <AppBackNav />
      <div class="pt-30 md:pt-40">
        <div class="mb-35">
          <h3 class="mb-20 text-[22px] font-bold lg:text-[26px] xl:text-[28px]">
            1. Договор оферты
          </h3>
          <p class="mb-10">
            1.1. Продавец – Гражданин Микерин Игорь Николаевич,
            зарегистрированный в качестве налогоплательщика на профессиональный
            доход (самозанятого) в г. Челябинск, ИНН 741204653773;
          </p>
          <p class="mb-10">
            1.2. Публичная оферта – публичное предложение Продавца, адресованное
            неопределенному кругу лиц, заключить с Продавцом договор
            купли-продажи товаров дистанционным способом (далее - «Договор»);
          </p>
          <p class="mb-10">
            1.3. Покупатель – физическое лицо, использующее программные средства
            просмотра контента в сети Интернет, принимающее условия настоящего
            Договора и выражающее желание купить товар, сведения о котором
            размещены на сайте
            <a href="https://ayaysee.com/" target="_blank">
              https://ayaysee.com
            </a>
            ;
          </p>
          <p class="mb-10">
            1.4. Товар – изделия российского производства, предлагаемые к
            продаже на сайте
            <a href="https://ayaysee.com/" target="_blank">
              https://ayaysee.com
            </a>
            ;
          </p>
          <p class="mb-10">
            1.5. Интернет-магазин – сайт в сети Интернет, расположенный по
            адресу
            <a href="https://ayaysee.com/" target="_blank">
              https://ayaysee.com
            </a>
            , на котором любой Покупатель может ознакомиться с представленными
            Товарами, их описанием и ценами, выбрать определённый Товар, способ
            оплаты, сформировать и отправить Заказ Продавцу;
          </p>
          <p class="mb-10">
            1.6. Заказ – оформленный запрос Покупателя на приобретение, оплату и
            доставку Товара, выбранного на сайте
            <a href="https://ayaysee.com/" target="_blank">
              https://ayaysee.com
            </a>
            , отправленный Продавцу посредством сети Интернет;
          </p>
          <p class="mb-10">
            1.8. Служба доставки – оператор российской государственной почтовой
            сети “Почта России”
            <a href="https://www.pochta.ru/" target="_blank">
              https://www.pochta.ru/
            </a>
            ; "СДЭК"
            <a href="https://www.cdek.ru/" target="_blank">
              https://www.cdek.ru
            </a>
            ;
          </p>
          <p class="mb-10">
            1.9. Сайт – сайт Продавца в сети Интернет, расположенный по адресу
            <a href="https://ayaysee.com/" target="_blank">
              https://ayaysee.com
            </a>
            .
          </p>
          <p class="mb-10">
            1.10 Предзаказ – (предварительный заказ) – это изъявление
            Покупателем намерения купить/забронировать какой-либо определенный
            Товар с последующей оплатой в указанные в настоящем Договоре сроки.
            Если на Товаре есть метка «Предзаказ» или «Pre-order», это означает,
            что в данный момент Товара нет в наличии, но он доступен к
            бронированию. Сроки отправки Товаров из категории «Предзаказ»
            определяются индивидуально и доносятся до сведения Покупателя
            посредством отправки письма на адрес электронной почты, указанный
            Покупателем, а также посредством массового уведомления на
            официальной страницах Продавца в мессенджере Telegram, доставка
            такого Товара в любом случае осуществляется в срок не ранее 21
            (Двадцати) одного дня с даты оплаты Товара Покупателем. При этом
            Покупатель соглашается, что Продавец имеет право осуществить
            доставку Товара посредством российской государственной почтовой сети
            www.cdek.ru в более ранний срок. Возврат Предзаказа осуществляется
            по общим правилам возврата Товаров, а именно после получения Товара,
            путем написания и отправки Продавцу Заявления на возврат Товара при
            условии обязательного предварительного уведомления Продавца путем
            написания сообщения/уведомления о необходимости возврата, используя
            доступные способы связи, а именно адрес официальной страницы
            Интернет-магазина в социальных сетях.
          </p>
        </div>

        <div class="mb-35">
          <h3 class="mb-20 text-[22px] font-bold lg:text-[26px] xl:text-[28px]">
            2. Общие положения
          </h3>
          <p class="mb-10">
            2.1. Заказывая Товар на сайте
            <a href="https://ayaysee.com/" target="_blank">
              https://ayaysee.com
            </a>
            Покупатель выражает свое согласие с вышеизложенными условиями
            продажи Товара и принимает их.
          </p>
          <p class="mb-10">
            2.2. Настоящие условия продажи Товара, а также информация о Товаре,
            представленная на сайте
            <a href="https://ayaysee.com/" target="_blank">
              https://ayaysee.com
            </a>
            , являются публичной офертой в соответствии со ст. 435 и п.2 ст. 437
            Гражданского кодекса Российской Федерации.
          </p>
          <p class="mb-10">
            2.3. Продавец имеет право вносить изменения и дополнения в настоящий
            Договор, размещенный по адресу
            <a href="https://ayaysee.com/" target="_blank">
              https://ayaysee.com
            </a>
            , при этом такие изменения вступают в силу с даты размещения на
            сайте Продавца. Покупатель принимает на себя обязательства
            отслеживать изменения и дополнения, внесенные в настоящий Договор.
            Самой актуальной версией Договора является версия, размещенная на
            сайте Продавца.
          </p>
          <p class="mb-10">
            2.4. Нажимая кнопку «CHECKOUT» при формировании Заказа на сайте,
            Пользователь подтверждает свое согласие с условиями продажи Товара,
            изложенными в настоящем Договоре,и одновременно предоставляет
            согласие на обработку персональных данных, полученных при оформлении
            Заказа.
          </p>
          <p class="mb-10">
            2.5. Настоящий Договор считается заключенным с момента
            выдачи/отправки Продавцом Покупателю кассового чека, подтверждающего
            полную оплату товара, или с момента получения Продавцом сообщения о
            намерении Покупателя приобрести товар , нажав кнопку «CHECKOUT».
          </p>
        </div>

        <div class="mb-35">
          <h3 class="mb-20 text-[22px] font-bold lg:text-[26px] xl:text-[28px]">
            3. Предмет договора
          </h3>
          <p class="mb-10">
            3.1. Продавец предоставляет возможность любому физическому лицу
            приобретать для личных, семейных или иных нужд, не связанных с
            осуществлением Покупателем Предпринимательской деятельности, Товары,
            представленные на сайте
            <a href="https://ayaysee.com/" target="_blank">
              https://ayaysee.com
            </a>
          </p>
          <p class="mb-10">
            3.2. Данный Договор распространяется на все виды Товаров,
            представленные на сайте
            <a href="https://ayaysee.com/" target="_blank">
              https://ayaysee.com
            </a>
            , пока такие предложения с описанием присутствуют в каталоге сайта.
          </p>
        </div>

        <div class="mb-35">
          <h3 class="mb-20 text-[22px] font-bold lg:text-[26px] xl:text-[28px]">
            4. Порядок оформления заказа
          </h3>
          <p class="mb-10">
            4.1. Оформление Заказа в Интернет-магазине осуществляется
            Покупателем самостоятельно. При оформлении Заказа Покупатель
            заполняет электронную форму Заказа Товара и отправляет
            сформированный Заказ Продавцу посредством системы сайта.
          </p>
          <p class="mb-10">
            4.2. При регистрации на сайте Интернет-магазина Покупатель обязуется
            предоставить следующую регистрационную информацию:
          </p>
          <p class="mb-10">
            4.2.1. фамилия, имя, отчество Покупателя или указанного им лица
            (получателя);
          </p>
          <p class="mb-10">
            4.2.2. адрес, по которому следует доставить Товар (если доставка до
            адреса Покупателя);
          </p>
          <p class="mb-10">4.2.3. адрес электронной почты;</p>
          <p class="mb-10">4.2.4. контактный телефон.</p>
          <p class="mb-10">
            4.3. Наименование, количество, ассортимент, цена выбранного
            Покупателем Товара указываются в корзине Покупателя на сайте
            Интернет-магазина.
          </p>
          <p class="mb-10">
            4.4. Продавец не несет ответственности за содержание и достоверность
            информации, предоставленной Покупателем при оформлении Заказа.
          </p>
          <p class="mb-10">
            4.5. Покупатель несет ответственность за достоверность
            предоставленной информации при оформлении Заказа.
          </p>
          <p class="mb-10">
            4.6. Описания и характеристики Товара в Интернет-магазине содержат
            основные и достоверные сведения о Товаре.
          </p>
          <p class="mb-10">
            4.7. По всем возникающим вопросам, касающимся свойств и
            характеристик Товара, Покупатель может обратиться к Продавцу,
            посредством отправки сообщения администратору официальной страницы
            Продавца в мессенджере
            <a href="https://web.telegram.org" target="_blank">
              https://web.telegram.org
            </a>
            -
            <a href="https://t.me/ayayseesupport" target="_blank">
              https://t.me/ayayseesupport
            </a>
            или отправив письмо на электронную почту ayaysee.corp@outlook.com.
          </p>
          <p class="mb-10">
            4.8. Фотографии и макеты Товара, представленные на сайте
            <a href="https://ayaysee.com/" target="_blank">
              https://ayaysee.com
            </a>
            , созданы в условиях специального освещения с использованием
            профессионального оборудования, либо откорректированы в программе
            Photoshop, являются простыми иллюстрациями и могут отличаться от
            фактического внешнего вида Товара при иных условиях наблюдения.
          </p>
          <p class="mb-10">
            4.9. Цена Товара указана на сайте
            <a href="https://ayaysee.com/" target="_blank">
              https://ayaysee.com
            </a>
            рядом с изображением Товара.
          </p>
          <p class="mb-10">
            4.10. Получить Товар Покупатель может путем доставки Почты России
            <a href="https://www.pochta.ru/" target="_blank">
              https://www.pochta.ru/
            </a>
            .
          </p>
          <p class="mb-10">
            4.11. Доставка Товара осуществляется по согласованию Покупателя и
            Продавца посредством службы доставки Почта России
            <a href="https://www.pochta.ru/" target="_blank">
              https://www.pochta.ru/
            </a>
            . Срок доставки Товара Покупателю состоит из срока обработки заказа
            и срока доставки.
          </p>
          <p class="mb-10">
            4.12. Оплата полной стоимости доставки осуществляется за счет
            Покупателя.
          </p>
          <p class="mb-10">
            4.13. Продажа Товара осуществляется путем 100% (Сто процентов)
            предоплаты стоимости Товара.
          </p>
          <p class="mb-10">
            4.14. Оплата производится путем использования платежной системы на
            сайте
          </p>
          <p class="mb-10">
            4.15. По оформлению заказа Покупателю предоставляется информация
            посредством отправки письма на адрес электронной почты, указанный
            Покупателем, далее возможно подключение Услуги оповещения на сайте
            Почты России
            <a href="https://www.pochta.ru/" target="_blank">
              https://www.pochta.ru/
            </a>
            . Срок доставки Товара может быть изменен Продавцом, о чем
            Покупатель уведомляется путем отправки письма на адрес электронной
            почты, указанного Покупателем.
          </p>
          <p class="mb-10">
            4.16. Покупатель получает уведомление о состоянии заказа посредством
            отправки письма на адрес электронной почты, далее возможно
            подключение Услуги оповещения на сайте Почты России
            <a href="https://www.pochta.ru/" target="_blank">
              https://www.pochta.ru/
            </a>
            .
          </p>
        </div>

        <div class="mb-35">
          <h3 class="mb-20 text-[22px] font-bold lg:text-[26px] xl:text-[28px]">
            5. Стоимость Товара и способы оплаты
          </h3>
          <p class="mb-10">
            5.1. Цена на Товар, представленный на сайте
            <a href="https://ayaysee.com/" target="_blank">
              https://ayaysee.com/
            </a>
            , указана в долларах.
          </p>
          <p class="mb-10">
            5.2. Цена Товара на сайте
            <a href="https://ayaysee.com/" target="_blank">
              https://ayaysee.com/
            </a>
            может быть изменена Продавцом в одностороннем порядке. При этом цена
            на заказанный Покупателем Товар изменению не подлежит, кроме
            случаев, указанных в п. 5.3.
          </p>
          <p class="mb-10">
            5.3. Продавец вправе предоставлять скидки на цену Товара, согласно
            действующим в Интернет-магазине в момент оформления Заказа торговым
            акциям. В случае предоставления Покупателем при оформлении Заказа
            недостоверных (ошибочных) данных, Продавец вправе при выдаче и
            оплате Товара произвести перерасчет суммы предоставленной скидки с
            цены Товара.
          </p>
          <p class="mb-10">
            5.4. Оплата Товара производится Банковской картой при оформлении
            Заказа на сайте с использованием платежной системы.
          </p>
          <p class="mb-10">
            5.5. Оплата доставки осуществляется Покупателем банковской картой
            при оформлении Заказа на сайте с использованием платежной системы.
          </p>
          <p class="mb-10">
            5.6. В случае отказа Покупателя от Товара, при возврате Покупателю
            суммы полной оплаты, внесенной Покупателем, банковские и иные
            комиссии, уплаченные Покупателем в этой связи, Продавцом
            компенсируются.
          </p>
        </div>

        <div class="mb-35">
          <h3 class="mb-20 text-[22px] font-bold lg:text-[26px] xl:text-[28px]">
            6. Гарантия, отмена Заказа, возврат Товара и предоплаты
          </h3>
          <p class="mb-10">
            6.1. Гарантийный срок на Товара равен 3 (Трём) днями исчисляется с
            момента передачи Товара Покупателю.
          </p>
          <p class="mb-10">
            6.2. Гарантия распространяется только на производственный брак и не
            распространяется на дефекты, образовавшиеся в результате:
            механических повреждений (царапин, разрывов, потертостей и т.д.);
            воздействия экстремальных температур, растворителей, кислот, воды;
            неправильного использования (эксплуатации); естественного износа.
          </p>
          <p class="mb-10">6.3. Порядок отмены Заказа:</p>
          <p class="mb-10">
            6.3.1. Для мгновенной отмены Заказа Покупателю необходимо связаться
            с Продавцом посредством отправки сообщения администратору
            официальной страницы Продавца в мессенджере
            <a href="https://web.telegram.org" target="_blank">
              https://web.telegram.org
            </a>
            -
            <a href="https://t.me/ayayseesupport" target="_blank">
              https://t.me/ayayseesupport
            </a>
            или отправив письмо на электронную почту ayaysee.corp@outlook.com.
          </p>
          <p class="mb-10">
            6.3.2. Договор купли-продажи считается расторгнутым автоматически, в
            случае непоступления полной оплаты стоимости Заказа.
          </p>
          <p class="mb-10">
            5.6. В случае отказа Покупателя от Товара, при возврате Покупателю
            суммы полной оплаты, внесенной Покупателем, банковские и иные
            комиссии, уплаченные Покупателем в этой связи, Продавцом
            компенсируются.
          </p>
          <p class="mb-10">
            6.4. Денежные средства, внесенные Покупателем с банковской карты с
            использованием электронного средства платежа, возвращаются в течение
            30 (Тридцати) рабочих дней с даты отказа Покупателя от
            Заказа/расторжения договора на тот лицевой счет/банковскую карту, с
            которой была внесена оплата Заказа. Возврат денежных средств за
            Заказ, внесенных иными средствами платежа (п.5.4.1- 5.4.3 настоящего
            Договора),осуществляется в течение 5 (Пяти) рабочих дней с даты
            подачи Покупателем соответствующего заявления в магазин Продавца, в
            котором была внесена оплата.
          </p>
          <p class="mb-10">
            6.5. Товар надлежащего качества, полученный Покупателем, обмену и
            возврату не подлежит.
          </p>
          <p class="mb-10">
            6.6. В случае выявления производственного брака, Покупатель
            обязуется подтвердить данный факт проведением экспертизы, в случае
            положительного подтверждения экспертизой, возврат Товара возможен в
            срок не позднее 10 (Десяти) дней с момента покупки такого Товара
            Покупателем.
          </p>
        </div>

        <div class="mb-35">
          <h3 class="mb-20 text-[22px] font-bold lg:text-[26px] xl:text-[28px]">
            7. Ответственность
          </h3>
          <p class="mb-10">
            7.1. За неисполнение или ненадлежащее исполнение своих обязательств
            по Договору Стороны несут ответственность в соответствии с
            действующим законодательством РФ.
          </p>
          <p class="mb-10">
            7.2. Совокупная ответственность Продавца по настоящему Договору
            ограничивается суммой платежа, уплаченного Покупателем по Договору.
          </p>
          <p class="mb-10">
            7.3. Не вступая в противоречие с указанным выше, Продавец
            освобождается от ответственности за нарушение условий Договора, если
            такое нарушение вызвано действием обстоятельств непреодолимой силы
            (форс-мажор) включая: действия органов государственной̆ власти (в
            т.ч. принятие правовых актов), пожар, наводнение, землетрясение,
            другие стихийные бедствия, отсутствие электроэнергии и/или сбои
            работы компьютерной сети, забастовки, гражданские волнения,
            беспорядки, любые иные обстоятельства, не ограничиваясь
            перечисленным, которые могут повлиять на исполнение Продавцом
            Договора.
          </p>
        </div>

        <div class="mb-35">
          <h3 class="mb-20 text-[22px] font-bold lg:text-[26px] xl:text-[28px]">
            8. Прочие условия
          </h3>
          <p class="mb-10">
            8.1. Покупатель обязуется дать свое согласие на обработку
            персональных данных путем подтверждения Положения о политике
            конфиденциальности персональных данных, размещенной на сайте
            <a href="https://ayaysee.com/" target="_blank">
              https://ayaysee.com/
            </a>
            .
          </p>
          <p class="mb-10">
            8.2. Сайт
            <a href="https://ayaysee.com/" target="_blank">
              https://ayaysee.com/
            </a>
            и предоставляемые сервисы могут временно частично или полностью
            недоступны по причине проведения профилактических или иных работ или
            по любым другим причинам технического характера.
          </p>
          <p class="mb-10">
            8.3. В случае возникновения вопросов и претензий со стороны
            Покупателя он вправе обратиться к Продавцу посредством отправки
            сообщения администратору официальной страницы Продавца в мессенджере
            <a href="https://web.telegram.org" target="_blank">
              https://web.telegram.org
            </a>
            -
            <a href="https://t.me/ayayseesupport" target="_blank">
              https://t.me/ayayseesupport
            </a>
            или отправив письмо на электронную почту ayaysee.corp@outlook.com.
            Все Возникающее споры стороны будут стараться решить путем
            переговоров, при недостижении соглашения, соответствующий спор
            подлежит разрешению в суде.
          </p>
        </div>
      </div>
    </div>
  </div>
</template>

<style lang="scss" scoped>
.title {
  @include laptop-big {
    -webkit-text-stroke-width: 1px;
  }
}

a {
  @apply underline;
}
</style>
